ghix-tools/test/GHIX_UI_Automation_Tests/resources/payloads/NV/templates/HH1_template.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Header>
        <wsse:Security soap:mustUnderstand="true" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
            <wsse:UsernameToken wsu:Id="UsernameToken-84816E57F38B10764D16032967208211">
                <wsse:Username>AT_USERNAME</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordDigest">AT_PASSWORD_DIGEST</wsse:Password>
                <wsse:Nonce EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">AT_NONCE</wsse:Nonce>
                <wsu:Created>AT_CREATED</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <AccountTransferRequest ns4:atVersionText="2.4" xmlns:ns6="http://niem.gov/niem/domains/screening/2.1" xmlns="http://at.dsh.cms.gov/exchange/1.0" xmlns:ns5="http://hix.cms.gov/0.1/hix-ee" xmlns:ns7="http://hix.cms.gov/0.1/hix-pm" xmlns:ns2="http://hix.cms.gov/0.1/hix-core" xmlns:ns1="http://niem.gov/niem/structures/2.0" xmlns:ns4="http://at.dsh.cms.gov/extension/1.0" xmlns:ns3="http://niem.gov/niem/niem-core/2.0">
            <ns4:TransferHeader>
                <ns4:TransferActivity>
                    <ns3:ActivityIdentification>
                        <ns3:IdentificationID>REMOTE_ID</ns3:IdentificationID>
                    </ns3:ActivityIdentification>
                    <ns3:ActivityDate>
                        <ns3:DateTime>CURRENT_DATE_UTCZ</ns3:DateTime>
                    </ns3:ActivityDate>
                    <ns4:TransferActivityReferralQuantity>1</ns4:TransferActivityReferralQuantity>
                    <ns4:RecipientTransferActivityCode>Exchange</ns4:RecipientTransferActivityCode>
                    <ns4:RecipientTransferActivityStateCode>NV</ns4:RecipientTransferActivityStateCode>
                </ns4:TransferActivity>
            </ns4:TransferHeader>
            <ns2:Sender ns1:id="Sender">
                <ns2:InformationExchangeSystemCategoryCode>MedicaidAgency</ns2:InformationExchangeSystemCategoryCode>
                <ns2:InformationExchangeSystemStateCode>NV</ns2:InformationExchangeSystemStateCode>
            </ns2:Sender>
            <ns2:Receiver ns1:id="Receiver">
                <ns2:InformationExchangeSystemCategoryCode>Exchange</ns2:InformationExchangeSystemCategoryCode>
            </ns2:Receiver>
            <ns5:InsuranceApplication>
                <ns2:ApplicationCreation>
                    <ns3:ActivityDate>
                        <ns3:Date>CURRENT_DATE_YYYY-MM-DD</ns3:Date>
                    </ns3:ActivityDate>
                </ns2:ApplicationCreation>
                <ns2:ApplicationSubmission xsi:type="ns2:ActivityType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <ns3:ActivityDate>
                        <ns3:Date>CURRENT_DATE_YYYY-MM-DD</ns3:Date>
                    </ns3:ActivityDate>
                </ns2:ApplicationSubmission>
                <ns2:ApplicationIdentification>
                    <ns3:IdentificationID>APPLICATION_ID</ns3:IdentificationID>
                    <ns3:IdentificationCategoryText>Exchange</ns3:IdentificationCategoryText>
                </ns2:ApplicationIdentification>
                <ns5:InsuranceApplicant>
                    <ns2:RoleOfPersonReference ns1:ref="TEST_109199959"/>
                    <ns5:InsuranceApplicantFixedAddressIndicator>true</ns5:InsuranceApplicantFixedAddressIndicator>
                    <ns5:InsuranceApplicantIncarceration ns1:metadata="NV_IncarcerationStatus_109199959">
                        <ns2:IncarcerationIndicator>false</ns2:IncarcerationIndicator>
                    </ns5:InsuranceApplicantIncarceration>
                    <ns5:InsuranceApplicantNonESICoverageIndicator>false</ns5:InsuranceApplicantNonESICoverageIndicator>
                    <ns5:MedicaidMAGIEligibility ns1:id="MedicaidMAGIEligibility_AF_109199959">
                        <ns5:EligibilityIndicator>false</ns5:EligibilityIndicator>
                        <ns5:EligibilityEstablishingSystem>
                            <ns2:InformationExchangeSystemCategoryCode>MedicaidAgency</ns2:InformationExchangeSystemCategoryCode>
                            <ns2:InformationExchangeSystemStateCode>NV</ns2:InformationExchangeSystemStateCode>
                        </ns5:EligibilityEstablishingSystem>
                        <ns5:MedicaidMAGIIncomeEligibilityBasis>
                            <ns2:StatusIndicator>false</ns2:StatusIndicator>
                            <ns5:EligibilityBasisStatusCode>Complete</ns5:EligibilityBasisStatusCode>
                            <ns5:EligibilityBasisDetermination>
                                <ns3:ActivityDate>
                                    <ns3:DateTime>CURRENT_DATE_UTCZ</ns3:DateTime>
                                </ns3:ActivityDate>
                            </ns5:EligibilityBasisDetermination>
                            <ns5:IncomeCompatibility>
                                <ns5:IncomeCompatibilityDetermination>
                                    <ns3:ActivityDate>
                                        <ns3:DateTime>CURRENT_DATE_UTCZ</ns3:DateTime>
                                    </ns3:ActivityDate>
                                </ns5:IncomeCompatibilityDetermination>
                            </ns5:IncomeCompatibility>
                        </ns5:MedicaidMAGIIncomeEligibilityBasis>
                    </ns5:MedicaidMAGIEligibility>
                    <ns5:ExchangeEligibility ns1:id="ExchangeEligibilityType_109199959"/>
                    <ns5:ReferralActivity>
                        <ns3:ActivityIdentification>
                            <ns3:IdentificationID>NV718791234513248005</ns3:IdentificationID>
                        </ns3:ActivityIdentification>
                        <ns3:ActivityDate>
                            <ns3:DateTime>CURRENT_DATE_UTCZ</ns3:DateTime>
                        </ns3:ActivityDate>
                        <ns5:ReferralActivitySenderReference ns1:ref="Sender"/>
                        <ns5:ReferralActivityReceiverReference ns1:ref="Receiver"/>
                        <ns5:ReferralActivityStatus>
                            <ns5:ReferralActivityStatusCode>Initiated</ns5:ReferralActivityStatusCode>
                        </ns5:ReferralActivityStatus>
                        <ns5:ReferralActivityEligibilityReasonReference ns1:ref="ExchangeEligibilityType_109199959"/>
                    </ns5:ReferralActivity>
                </ns5:InsuranceApplicant>
                <ns5:InsuranceApplicationRequestingFinancialAssistanceIndicator>true</ns5:InsuranceApplicationRequestingFinancialAssistanceIndicator>
                <ns5:SSFSigner>
                    <ns2:RoleOfPersonReference ns1:ref="TEST_109199959"/>
                    <ns5:Signature>
                        <ns2:SignatureName>
                            <ns3:PersonFullName>PERSON1_FIRST_NAME PERSON1_LAST_NAME</ns3:PersonFullName>
                        </ns2:SignatureName>
                        <ns2:SignatureDate>
                            <ns3:Date>CURRENT_DATE_YYYY-MM-DD</ns3:Date>
                        </ns2:SignatureDate>
                    </ns5:Signature>
                    <ns5:SSFAttestation>
                        <ns5:SSFAttestationCollectionsAgreementIndicator>true</ns5:SSFAttestationCollectionsAgreementIndicator>
                        <ns5:SSFAttestationMedicaidObligationsIndicator>true</ns5:SSFAttestationMedicaidObligationsIndicator>
                        <ns5:SSFAttestationNonPerjuryIndicator>true</ns5:SSFAttestationNonPerjuryIndicator>
                        <ns5:SSFAttestationNotIncarceratedIndicator>true</ns5:SSFAttestationNotIncarceratedIndicator>
                        <ns5:SSFAttestationNotIncarceratedIndicator>true</ns5:SSFAttestationNotIncarceratedIndicator>
                        <ns5:SSFAttestationInformationChangesIndicator>true</ns5:SSFAttestationInformationChangesIndicator>
                    </ns5:SSFAttestation>
                </ns5:SSFSigner>
                <ns5:InsuranceApplicationRequestingMedicaidIndicator>true</ns5:InsuranceApplicationRequestingMedicaidIndicator>
                <ns5:SSFPrimaryContact>
                    <ns2:RoleOfPersonReference ns1:ref="TEST_109199959"/>
                    <ns5:SSFPrimaryContactPreferenceCode>Mail</ns5:SSFPrimaryContactPreferenceCode>
                </ns5:SSFPrimaryContact>
                <ns5:InsuranceApplicationTaxReturnAccessIndicator>false</ns5:InsuranceApplicationTaxReturnAccessIndicator>
            </ns5:InsuranceApplication>
            <ns5:MedicaidHousehold>
                <ns5:HouseholdIncome>
                    <ns2:IncomeFrequency>
                        <ns2:FrequencyCode>PERSON1_INCOME_FREQUENCY_CODE</ns2:FrequencyCode>
                    </ns2:IncomeFrequency>
                    <ns2:IncomeAmount>PERSON1_INCOME_AMOUNT</ns2:IncomeAmount>
                    <ns2:IncomeCategoryCode>PERSON1_INCOME_CATEGORY_CODE</ns2:IncomeCategoryCode>
                </ns5:HouseholdIncome>
                <ns5:HouseholdMemberReference ns1:ref="TEST_109199959"/>
            </ns5:MedicaidHousehold>
            <ns2:Person ns1:id="TEST_109199959">
                <ns3:PersonBirthDate>
                    <ns3:Date>PERSON1_BIRTH_DATE</ns3:Date>
                </ns3:PersonBirthDate>
                <ns3:PersonName>
                    <ns3:PersonGivenName>PERSON1_FIRST_NAME</ns3:PersonGivenName>
                    <ns3:PersonSurName>PERSON1_LAST_NAME</ns3:PersonSurName>
                </ns3:PersonName>
                <ns3:PersonSexText>PERSON1_GENDER</ns3:PersonSexText>
                <ns3:PersonUSCitizenIndicator>true</ns3:PersonUSCitizenIndicator>
                <ns2:TribalAugmentation>
                    <ns2:PersonAmericanIndianOrAlaskaNativeIndicator>PERSON1_AIAN_INDICATOR</ns2:PersonAmericanIndianOrAlaskaNativeIndicator>
                </ns2:TribalAugmentation>
                <ns2:PersonAugmentation>
                    <ns2:PersonAssociation>
                        <ns2:FamilyRelationshipCode>18</ns2:FamilyRelationshipCode>
                    </ns2:PersonAssociation>
                    <ns2:PersonContactInformationAssociation>
                        <ns2:ContactInformation>
                            <ns3:ContactMailingAddress>
                                <ns3:StructuredAddress>
                                    <ns3:LocationStreet>
                                        <ns3:StreetFullText>ADDRESS_LINE_1</ns3:StreetFullText>
                                    </ns3:LocationStreet>
                                    <ns3:LocationCityName>CITY_NAME</ns3:LocationCityName>
                                    <ns3:LocationStateUSPostalServiceCode>STATE_CODE</ns3:LocationStateUSPostalServiceCode>
                                    <ns3:LocationPostalCode>ZIP_CODE</ns3:LocationPostalCode>
                                </ns3:StructuredAddress>
                            </ns3:ContactMailingAddress>
                            <ns3:ContactEmailID>PERSON1_EMAIL</ns3:ContactEmailID>
                        </ns2:ContactInformation>
                        <ns2:ContactInformationCategoryCode>Home</ns2:ContactInformationCategoryCode>
                    </ns2:PersonContactInformationAssociation>
                    <ns2:PersonContactInformationAssociation>
                        <ns3:ContactInformationIsPrimaryIndicator>true</ns3:ContactInformationIsPrimaryIndicator>
                        <ns2:ContactInformation>
                            <ns3:ContactTelephoneNumber>
                                <ns3:FullTelephoneNumber>
                                    <ns3:TelephoneNumberFullID>PHONE_NUMBER_VAR</ns3:TelephoneNumberFullID>
                                </ns3:FullTelephoneNumber>
                            </ns3:ContactTelephoneNumber>
                        </ns2:ContactInformation>
                        <ns2:ContactInformationCategoryCode>Home</ns2:ContactInformationCategoryCode>
                    </ns2:PersonContactInformationAssociation>
                    <ns2:PersonContactInformationAssociation>
                        <ns2:ContactInformation>
                            <ns3:ContactMailingAddress>
                                <ns3:StructuredAddress>
                                    <ns3:LocationStreet>
                                        <ns3:StreetFullText>ADDRESS_LINE_1</ns3:StreetFullText>
                                    </ns3:LocationStreet>
                                    <ns3:LocationCityName>CITY_NAME</ns3:LocationCityName>
                                    <ns3:LocationStateUSPostalServiceCode>STATE_CODE</ns3:LocationStateUSPostalServiceCode>
                                    <ns3:LocationPostalCode>ZIP_CODE</ns3:LocationPostalCode>
                                </ns3:StructuredAddress>
                                <ns3:ContactEmailID>PERSON1_EMAIL</ns3:ContactEmailID>
                            </ns3:ContactMailingAddress>
                        </ns2:ContactInformation>
                        <ns2:ContactInformationCategoryCode>Mailing</ns2:ContactInformationCategoryCode>
                    </ns2:PersonContactInformationAssociation>
                    <ns2:PersonContactInformationAssociation>
                        <ns3:ContactInformationIsPrimaryIndicator>false</ns3:ContactInformationIsPrimaryIndicator>
                        <ns2:ContactInformation>
                            <ns3:ContactTelephoneNumber>
                                <ns3:FullTelephoneNumber>
                                    <ns3:TelephoneNumberFullID>PHONE_NUMBER_VAR</ns3:TelephoneNumberFullID>
                                </ns3:FullTelephoneNumber>
                            </ns3:ContactTelephoneNumber>
                        </ns2:ContactInformation>
                    </ns2:PersonContactInformationAssociation>
                    <ns2:PersonMedicaidIdentification>
                        <ns3:IdentificationID>PERSON1_MEDICAID_ID</ns3:IdentificationID>
                    </ns2:PersonMedicaidIdentification>
                    <ns2:PersonIncome>
                        <ns2:IncomeFrequency>
                            <ns2:FrequencyCode>PERSON1_INCOME_FREQUENCY_CODE</ns2:FrequencyCode>
                        </ns2:IncomeFrequency>
                        <ns2:IncomeAmount>PERSON1_INCOME_AMOUNT</ns2:IncomeAmount>
                        <ns2:IncomeCategoryCode>PERSON1_INCOME_CATEGORY_CODE</ns2:IncomeCategoryCode>
                        <ns2:IncomeEmploymentDescriptionText>FARMING</ns2:IncomeEmploymentDescriptionText>
                    </ns2:PersonIncome>
                    <ns2:PersonPreferredLanguage>
                        <ns3:LanguageName>English</ns3:LanguageName>
                        <ns3:PersonWritesLanguageIndicator>true</ns3:PersonWritesLanguageIndicator>
                    </ns2:PersonPreferredLanguage>
                    <ns2:PersonCHIPIdentification>
                        <ns3:IdentificationID>109199959</ns3:IdentificationID>
                    </ns2:PersonCHIPIdentification>
                    <ns2:PersonMarriedIndicator>false</ns2:PersonMarriedIndicator>
                </ns2:PersonAugmentation>
            </ns2:Person>
            <ns2:VerificationMetadata ns1:id="NV_SSN_109199959">
                <ns2:VerificationAuthorityName>SSA</ns2:VerificationAuthorityName>
                <ns2:VerificationDate>
                    <ns3:DateTime>CURRENT_DATE_UTCZ</ns3:DateTime>
                </ns2:VerificationDate>
                <ns2:VerificationRequestingSystem>
                    <ns2:InformationExchangeSystemCategoryCode>MedicaidAgency</ns2:InformationExchangeSystemCategoryCode>
                    <ns2:InformationExchangeSystemStateCode>NV</ns2:InformationExchangeSystemStateCode>
                </ns2:VerificationRequestingSystem>
                <ns2:VerificationIndicator>true</ns2:VerificationIndicator>
                <ns2:VerificationStatus>
                    <ns2:VerificationStatusCode>5</ns2:VerificationStatusCode>
                </ns2:VerificationStatus>
                <ns2:VerificationCategoryCode>SSN</ns2:VerificationCategoryCode>
            </ns2:VerificationMetadata>
            <ns2:VerificationMetadata ns1:id="NV_IncarcerationStatus_109199959">
                <ns2:VerificationAuthorityName>SSA</ns2:VerificationAuthorityName>
                <ns2:VerificationDate>
                    <ns3:DateTime>CURRENT_DATE_UTCZ</ns3:DateTime>
                </ns2:VerificationDate>
                <ns2:VerificationRequestingSystem>
                    <ns2:InformationExchangeSystemCategoryCode>MedicaidAgency</ns2:InformationExchangeSystemCategoryCode>
                    <ns2:InformationExchangeSystemStateCode>NV</ns2:InformationExchangeSystemStateCode>
                </ns2:VerificationRequestingSystem>
                <ns2:VerificationIndicator>false</ns2:VerificationIndicator>
                <ns2:VerificationStatus>
                    <ns2:VerificationStatusCode>5</ns2:VerificationStatusCode>
                </ns2:VerificationStatus>
                <ns2:VerificationCategoryCode>IncarcerationStatus</ns2:VerificationCategoryCode>
            </ns2:VerificationMetadata>
            <ns2:VerificationMetadata ns1:id="NV_Citizenship_109199959">
                <ns2:VerificationAuthorityName>SSA</ns2:VerificationAuthorityName>
                <ns2:VerificationDate>
                    <ns3:DateTime>CURRENT_DATE_UTCZ</ns3:DateTime>
                </ns2:VerificationDate>
                <ns2:VerificationRequestingSystem>
                    <ns2:InformationExchangeSystemCategoryCode>MedicaidAgency</ns2:InformationExchangeSystemCategoryCode>
                    <ns2:InformationExchangeSystemStateCode>NV</ns2:InformationExchangeSystemStateCode>
                </ns2:VerificationRequestingSystem>
                <ns2:VerificationIndicator>true</ns2:VerificationIndicator>
                <ns2:VerificationStatus>
                    <ns2:VerificationStatusCode>5</ns2:VerificationStatusCode>
                </ns2:VerificationStatus>
                <ns2:VerificationCategoryCode>Citizenship</ns2:VerificationCategoryCode>
            </ns2:VerificationMetadata>
            <ns4:PhysicalHousehold>
                <ns5:HouseholdMemberReference ns1:ref="TEST_109199959"/>
            </ns4:PhysicalHousehold>
        </AccountTransferRequest>
    </soap:Body>
</soap:Envelope>
